In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to change the path if needed.)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read the School Data and Student Data and store into a Pandas DataFrame
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

# Cleaning Student Names and Replacing Substrings in a Python String
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

# Check names.
student_data_df.head()

C:\Users\rhutc\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:19: FutureWarning: The default value of regex will change from True to False in a future version.

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math
0,0,Paul Bradley,M,9th,Huang High School,66,79,NaN,81.87784,78.985371
1,1,Victor Smith,M,12th,Huang High School,94,61,NaN,NaN,NaN
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,NaN,NaN,NaN
3,3,Richard Scott,M,12th,Huang High School,67,58,NaN,NaN,NaN
4,4,Bonnie Ray,F,9th,Huang High School,97,84,NaN,NaN,NaN

In [2]:
student_data_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'Unnamed: 7', 'Read', 'Math'],
      dtype='object')

In [3]:
# Install numpy using conda install numpy or pip install numpy. 
# Step 1. Import numpy as np.
import numpy as np

In [4]:
# Step 2. Use the loc method on the student_data_df to select all the reading scores from the 9th grade at Thomas High School and replace them with NaN.
student_data_df.loc[(student_data_df["school_name"]=="Thomas High School") & (student_data_df["grade"]=="9th") ,"reading_score" ]=np.nan

In [5]:
#  Step 3. Refactor the code in Step 2 to replace the math scores with NaN.

student_data_df.loc[(student_data_df["school_name"]=="Thomas High School") & (student_data_df["grade"]=="9th") ,"math_score" ]=np.nan

In [6]:
#  Step 4. Check the student data for NaN's. 

student_data_df.tail(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math
39160,39160,Katie Weaver,F,11th,Thomas High School,89.0,86.0,NaN,NaN,NaN
39161,39161,April Reyes,F,10th,Thomas High School,70.0,84.0,NaN,NaN,NaN
39162,39162,Derek Weeks,M,12th,Thomas High School,94.0,77.0,NaN,NaN,NaN
39163,39163,John Reese,M,11th,Thomas High School,90.0,75.0,NaN,NaN,NaN
39164,39164,Joseph Anthony,M,9th,Thomas High School,NaN,NaN,NaN,NaN,NaN
39165,39165,Donna Howard,F,12th,Thomas High School,99.0,90.0,NaN,NaN,NaN
39166,39166,Dawn Bell,F,10th,Thomas High School,95.0,70.0,NaN,NaN,NaN
39167,39167,Rebecca Tanner,F,9th,Thomas High School,NaN,NaN,NaN,NaN,NaN
39168,39168,Desiree Kidd,F,10th,Thomas High School,99.0,90.0,NaN,NaN,NaN
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95.0,75.0,NaN,NaN,NaN

In [7]:
# Step 1 Create student summary and import pandas dependency.
import pandas as pd

In [8]:
# Load CSV files for students and schools
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [12]:
# Read the school data
school_data_df= pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [13]:
# read the school data
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math
0,0,Paul Bradley,M,9th,Huang High School,66,79,NaN,81.87784,78.985371
1,1,Victor Smith,M,12th,Huang High School,94,61,NaN,NaN,NaN
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,NaN,NaN,NaN
3,3,Richard Scott,M,12th,Huang High School,67,58,NaN,NaN,NaN
4,4,Bonnie Ray,F,9th,Huang High School,97,84,NaN,NaN,NaN

In [17]:
# Combine the data into a single dataset
school_data_complete_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,NaN,81.87784,78.985371,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,NaN,NaN,NaN,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,NaN,NaN,NaN,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,NaN,NaN,NaN,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,NaN,NaN,NaN,0,District,2917,1910635

In [21]:
# 1. Get the number of students that are in ninth grade at Thomas High School.

ninth_THS_count = school_data_complete_df.loc[(school_data_complete_df["school_name"]=="Thomas High School") & (school_data_complete_df["grade"]=="9th"),"Student ID"].count()
ninth_THS_count

461

In [23]:
# Get the total student count
student_count = school_data_complete_df["Student ID"].count()
student_count

new_student_count = student_count - ninth_THS_count
new_student_count

38709

In [24]:
# Get the total school count
school_count = school_data_df["school_name"].count()
school_count

15

In [25]:
# Calculate the total budget.
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [26]:
# Calculate average math score
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [27]:
# Calculate average reading score
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [28]:
# In Step 2, subtract the number of students retrieved from Step 1 from the total student count to get the new total student count.

new_student_count = student_count - ninth_THS_count
new_student_count

38709

In [29]:
# In Step 3, calculate the math passing percentages based on the new total student count

passing_math_count = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)].count()["student_name"]
passing_math_count

29370

In [30]:
# In Step 3, calculate the reading passing percentages based on the new total student count

passing_reading_count = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)].count()["student_name"]
passing_reading_count

33610

In [31]:
# Percent that passed reading
passing_reading_percentage = passing_reading_count / float(new_student_count) 

# Percent that passed math
passing_math_percentage = passing_math_count / float(new_student_count)

In [32]:
reading_percentage = "{:.2%}".format(passing_reading_percentage)
print(reading_percentage)

math_percentage = "{:.2%}".format(passing_math_percentage)
print(math_percentage)

86.83%
75.87%

In [33]:
# Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,NaN,NaN,NaN,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,NaN,NaN,NaN,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,NaN,NaN,NaN,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,NaN,NaN,NaN,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,NaN,NaN,NaN,0,District,2917,1910635

In [34]:
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [35]:
# In Step 4, calculate the overall passing percentage with the new total student count

overall_passing_percentage = overall_passing_math_reading_count / new_student_count * 100
overall_passing_percentage

65.94848743186338

In [36]:
# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame(
    [{"Total Schools": school_count,
     "Total Students": new_student_count,
     "Total Budget": total_budget,
     "Average Math Score": average_math_score,
     "Average Reading Score": average_reading_score,
     "% Passing Math": passing_math_percentage,
     "% Passing Reading": passing_reading_percentage,
     "% Overall Passing": overall_passing_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,38709,24649428,78.985371,81.87784,0.758738,0.868274,65.948487

In [37]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"38,709",24649428,78.985371,81.87784,0.758738,0.868274,65.948487

In [38]:
# Determine the School Type
per_school_types = school_data_df.set_index(["school_name"])["type"]

# Calculate the total student count.
per_school_counts = school_data_complete_df["school_name"].value_counts()

# Calculate the total school budget and per capita spending
per_school_budget = school_data_complete_df.groupby(["school_name"]).mean()["budget"]
# Calculate the per capita spending.
per_school_capita = per_school_budget / per_school_counts

# Calculate the average test scores.
per_school_math = school_data_complete_df.groupby(["school_name"]).mean()["math_score"]
per_school_reading = school_data_complete_df.groupby(["school_name"]).mean()["reading_score"]

# Calculate the passing scores by creating a filtered DataFrame.
per_school_passing_math = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)]
per_school_passing_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)]

# Calculate the number of students passing math and passing reading by school.
per_school_passing_math = per_school_passing_math.groupby(["school_name"]).count()["student_name"]
per_school_passing_reading = per_school_passing_reading.groupby(["school_name"]).count()["student_name"]

# Calculate the percentage of passing math and reading scores per school.
per_school_passing_math = per_school_passing_math / per_school_counts * 100
per_school_passing_reading = per_school_passing_reading / per_school_counts * 100

# Calculate the students who passed both reading and math.
per_passing_math_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70) & (school_data_complete_df["math_score"] >= 70)]

# Calculate the number of students passing math and passing reading by school.
per_passing_math_reading = per_passing_math_reading.groupby(["school_name"]).count()["student_name"]

# Calculate the percentage of passing math and reading scores per school.
per_overall_passing_percentage = per_passing_math_reading / per_school_counts * 100

In [39]:
per_school_summary_df = pd.DataFrame({
    "School Type": per_school_types,
    "Total Students": per_school_counts,
    "Total School Budget": per_school_budget,
    "Per Student Budget": per_school_capita,
    "Average Math Score": per_school_math,
    "Average Reading Score": per_school_reading,
    "% Passing Math": per_school_passing_math,
    "% Passing Reading": per_school_passing_reading,
    "% Overall Passing": per_overall_passing_percentage})

per_school_summary_df.head(100)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,3124928.0,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,90.599455
Hernandez High School,District,4635,3022020.0,652.0,77.289752,80.934412,66.752967,80.862999,53.527508
Holden High School,Charter,427,248087.0,581.0,83.803279,83.814988,92.505855,96.252927,89.227166
Huang High School,District,2917,1910635.0,655.0,76.629414,81.182722,65.683922,81.316421,53.513884
Johnson High School,District,4761,3094650.0,650.0,77.072464,80.966394,66.057551,81.222432,53.539172
Pena High School,Charter,962,585858.0,609.0,83.839917,84.044699,94.594595,95.945946,90.540541
Rodriguez High School,District,3999,2547363.0,637.0,76.842711,80.744686,66.366592,80.220055,52.988247
Shelton High School,Charter,1761,1056600.0,600.0,83.359455,83.725724,93.867121,95.854628,89.892107
Thomas High School,Charter,1635,1043130.0,638.0,83.418349,83.848930,93.272171,97.308869,90.948012
Wilson High School,Charter,2283,1319574.0,578.0,83.274201,83.989488,93.867718,96.539641,90.582567
Wright High School,Charter,1800,1049400.0,583.0,83.682222,83.955000,93.333333,96.611111,90.333333

In [40]:
per_school_summary_df.loc[["Thomas High School"]]

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Thomas High School,Charter,1635,1043130.0,638.0,83.418349,83.84893,93.272171,97.308869,90.948012

In [71]:
#  Step 5. Get the number of 10th-12th graders from Thomas High School (THS).
THS_students10 = student_data_df.loc[(student_data_df["school_name"]=="Thomas High School")
                & (student_data_df["grade"]!="10th"),"Student ID"].count()

THS_students11 = student_data_df.loc[(student_data_df["school_name"]=="Thomas High School")
                & (student_data_df["grade"]!="11th"),"Student ID"].count()

THS_students12 = student_data_df.loc[(student_data_df["school_name"]=="Thomas High School")
                & (student_data_df["grade"]!="12th"),"Student ID"].count()

Total_THS_students_10_11_12_grades = THS_students10 + THS_students11 + THS_students12
THS_students

3731

In [48]:
# In Step 6, use the loc method to create a new DataFrame that has all the students passing math from Thomas High School.
THS_passing_math =school_data_complete_df.loc[
    (school_data_complete_df["school_name"] == "Thomas High School") & 
    (school_data_complete_df["math_score"] >= 70)
]
THS_passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math,School ID,type,size,budget
37535,37535,Norma Mata,F,10th,Thomas High School,76,76,NaN,NaN,NaN,14,Charter,1635,1043130
37536,37536,Cody Miller,M,11th,Thomas High School,84,82,NaN,NaN,NaN,14,Charter,1635,1043130
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90,NaN,NaN,NaN,14,Charter,1635,1043130
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76,NaN,NaN,NaN,14,Charter,1635,1043130
37540,37540,Austin Meyer,M,9th,Thomas High School,73,96,NaN,NaN,NaN,14,Charter,1635,1043130

In [75]:
# In Step 7, use the loc method to create a new DataFrame that has all the students passing reading from Thomas High School.

total_passing_reading_grade = school_data_complete_df.loc[
    (school_data_complete_df["school_name"] == "Thomas High School") &
    (school_data_complete_df["reading_score"] >= 70)
]
total_passing_reading_grade.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math,School ID,type,size,budget
37535,37535,Norma Mata,F,10th,Thomas High School,76,76,NaN,NaN,NaN,14,Charter,1635,1043130
37536,37536,Cody Miller,M,11th,Thomas High School,84,82,NaN,NaN,NaN,14,Charter,1635,1043130
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90,NaN,NaN,NaN,14,Charter,1635,1043130
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,69,NaN,NaN,NaN,14,Charter,1635,1043130
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76,NaN,NaN,NaN,14,Charter,1635,1043130

In [50]:
# In Step 8, use the loc method to create a new DataFrame that has all the students passing math and reading from Thomas High School.

total_passing_math_grade = school_data_complete_df.loc[
    (school_data_complete_df["school_name"] == "Thomas High School") & 
    (school_data_complete_df["math_score"] >= 70)
]
total_passing_math_grade.head()

total_passing_reading_grade = school_data_complete_df.loc[
    (school_data_complete_df["school_name"] == "Thomas High School") & 
    (school_data_complete_df["reading_score"] >= 70)
]
total_passing_reading_grade.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Unnamed: 7,Read,Math,School ID,type,size,budget
37535,37535,Norma Mata,F,10th,Thomas High School,76,76,NaN,NaN,NaN,14,Charter,1635,1043130
37536,37536,Cody Miller,M,11th,Thomas High School,84,82,NaN,NaN,NaN,14,Charter,1635,1043130
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90,NaN,NaN,NaN,14,Charter,1635,1043130
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,69,NaN,NaN,NaN,14,Charter,1635,1043130
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76,NaN,NaN,NaN,14,Charter,1635,1043130
37540,37540,Austin Meyer,M,9th,Thomas High School,73,96,NaN,NaN,NaN,14,Charter,1635,1043130
37541,37541,Eric Stevens,M,10th,Thomas High School,80,76,NaN,NaN,NaN,14,Charter,1635,1043130
37542,37542,Elizabeth Bennett,F,11th,Thomas High School,91,94,NaN,NaN,NaN,14,Charter,1635,1043130
37543,37543,Madison Hampton,F,9th,Thomas High School,82,73,NaN,NaN,NaN,14,Charter,1635,1043130
37544,37544,Jacqueline Harris,F,10th,Thomas High School,71,92,NaN,NaN,NaN,14,Charter,1635,1043130

In [73]:
# In Step 9, calculate the percentage of 10th-12th grade students passing math from Thomas High School.

THS_passing_math_percent = THS_passing_math["Student ID"].count() / Total_THS_students_10_11_12_grades * 100 
THS_passing_math_percent

40.87376038595551

In [69]:
THS_students

3731

In [70]:
THS_passing_math["Student ID"].count()

1525